# 10_pandas

In [1]:
import numpy as np
import pandas as pd

In [2]:
# Series 만들기
{'a':1, "b":2, "c":3}
pd.Series({'a':1, "b":2, "c":3})

a    1
b    2
c    3
dtype: int64

In [8]:
# Series 연산하기
obj = pd.Series([100, 80, 70], index=['국어', '수학', '영어'])
print(obj.sum())
print(obj.mean())
print(obj.max())
print(obj.min())

250
83.33333333333333
100
70

In [9]:
obj

국어    100
수학     80
영어     70
dtype: int64

In [10]:
obj.mean()

83.33333333333333

In [12]:
# 실습하기. 국어, 수학, 영어의 점수가 평균보다 높은지 확인해주세요.
obj >= obj.mean()

국어     True
수학    False
영어    False
dtype: bool

In [16]:
# 과학 데이터를 추가하기
obj['과학'] = 95
obj

국어    100
수학     80
영어     70
과학     95
dtype: int64

In [17]:
# 실습하기. 영어의 점수를 85점으로 수정해주세요.
obj['영어'] = 85
obj

국어    100
수학     80
영어     85
과학     95
dtype: int64

In [18]:
# 데이터 삭제하기
del obj['영어']
obj

국어    100
수학     80
과학     95
dtype: int64

# DataFrame

In [21]:
pd.DataFrame({'상품명':['린넨 마스크', 'KF94'], '가격':[15000, 20000]})

      상품명     가격
0  린넨 마스크  15000
1    KF94  20000

In [27]:
# numpy를 이용한 dataframe만들기
np.arange(1, 13).reshape(3, 4)
df = pd.DataFrame(np.arange(1, 13).reshape(3, 4), columns = ['a', 'b', 'c', 'd']) # 3행 4열
df

   a   b   c   d
0  1   2   3   4
1  5   6   7   8
2  9  10  11  12

In [29]:
# 모양 보기
df.shape # 3행 4열

(3, 4)

In [30]:
# 길이 보기
len(df)

3

In [31]:
# 컬럼 확인
df.columns # 열

Index(['a', 'b', 'c', 'd'], dtype='object')

In [33]:
# 데이터 프레임 연산, 각 열에 대한 데이터 값
print(df.sum())
print(df.mean())
print(df.max())
print(df.min())

a    15
b    18
c    21
d    24
dtype: int64
a    5.0
b    6.0
c    7.0
d    8.0
dtype: float64
a     9
b    10
c    11
d    12
dtype: int32
a    1
b    2
c    3
d    4
dtype: int32

In [38]:
# 실습하기. df의 전체 총합
print(df.sum().sum())
print(sum(df.sum()))

78
78

## DataFrame에서 특정 컬럼이나 로우(인덱스) 조회하기
- loc: 라벨값 기반의 2차원 인덱싱
- iloc: index 기반의 2차원 인덱싱
- at: 라벨값 기반의 인덱싱(스칼라 값을 찾는데 사용)
- iat: index 기반의 인덱싱(스칼라 값을 찾는데 사용)

### loc
loc[행, 열]

In [102]:
df

   a   b   c   d
0  1   2   3   4
1  5   6   7   8
2  9  10  11  12

In [103]:
# display를 사용하면 데이터를 시각화할 수 있음
display(df.loc[:, :]) # 전체
print()
display(df.loc[1, 'b']) # 1행의 2열
print()
display(df.loc[:, 'a']) # a열만 조회하기

   a   b   c   d
0  1   2   3   4
1  5   6   7   8
2  9  10  11  12

6

0    1
1    5
2    9
Name: a, dtype: int32

In [104]:
# 실습하기. df의 0, 2행의 b, d열을 출력해주세요
df

   a   b   c   d
0  1   2   3   4
1  5   6   7   8
2  9  10  11  12

In [105]:
df.loc[[0,2],['b','d']]

    b   d
0   2   4
2  10  12

In [106]:
# 실습하기. df의 0행의 a, c, d열을 출력해주세요
df.loc[0, ['a', 'c', 'd']]

a    1
c    3
d    4
Name: 0, dtype: int32

In [107]:
# 실습하기. b와 d열의 평균을 조회해주세요
df.loc[:, ['b', 'd']].mean()

b    6.0
d    8.0
dtype: float64

In [108]:
# 실습하기. b와 d열의 평균의 합계를 조회해주세요
sum(df.loc[:, ['b', 'd']].mean())

14.0

In [109]:
df2 = pd.DataFrame({'name':['korea', 'bigdata', 'academy'], 'age':[9, 20, 17]})
df2

      name  age
0    korea    9
1  bigdata   20
2  academy   17

In [110]:
# age가 10 이상인 데이터만 조회하기
df2.loc[:,'age'] >= 10

df2.loc[df2.loc[:,'age'] >= 10, :] # 열의 이름이 한글인 경우 조회가 될 수 있고 안될 수 있음

      name  age
1  bigdata   20
2  academy   17

In [112]:
# age가 10 이상인 데이터만 조회학
df2.age >= 10
df2.loc[df2.age >= 10, :]

      name  age
1  bigdata   20
2  academy   17

In [116]:
# 실습하기. df2에서 name이 korea인 데이터만 조회해주세요
df2.name == 'korea'
df2.loc[df2.name == 'korea', :]

    name  age
0  korea    9

In [122]:
# df2의 name에서 d가 포함된 데이터만 조회해주세요
df2.name.str.contains('d')
df2.loc[df2.name.str.contains('d'), :]

      name  age
1  bigdata   20
2  academy   17

In [126]:
# df2의 age가 평균 이상인 데이터만 조회하기
a = (df2.age >= df2.age.mean())
df2.loc[a, :]

      name  age
1  bigdata   20
2  academy   17

In [129]:
# df2에 열을 추가하기
# - money라는 열을 추가하면서 1000, 2000, 3000으로 데이터 채우기
df2.loc[:, 'money'] = [1000, 2000, 3000]
df2

      name  age  money
0    korea    9   1000
1  bigdata   20   2000
2  academy   17   3000

### iloc

In [133]:
df

   a   b   c   d
0  1   2   3   4
1  5   6   7   8
2  9  10  11  12

In [132]:
# df의 0번째 행의 1번째 열을 출력하기
df.iloc[0, 1]

2

In [ ]:
df.iloc[0, 1] # df.iloc[0, 'b']는 에러 발생

In [143]:
# df의 1, 2행의 1, 3행을 출력하기
df.iloc[[1, 2], [1, 3]]

    b   d
1   6   8
2  10  12

In [144]:
# 실습하기. df의 1행의 모든 열에 *2를 해서 출력해주세요
df.iloc[1, :] * 2

a    10
b    12
c    14
d    16
Name: 1, dtype: int32

### at, iat
- 빠른 인덱싱 속도가 요구되는 경우에 사용

In [138]:
df

   a   b   c   d
0  1   2   3   4
1  5   6   7   8
2  9  10  11  12

In [145]:
%timeit df.loc[0, 'a']

7.28 µs ± 124 ns per loop (mean ± std. dev. of 7 runs, 100000 loops each)

In [146]:
%timeit df.iloc[0, 0]

16.5 µs ± 233 ns per loop (mean ± std. dev. of 7 runs, 100000 loops each)

In [147]:
%timeit df.at[0, 'a']

3.1 µs ± 54.1 ns per loop (mean ± std. dev. of 7 runs, 100000 loops each)

In [148]:
%timeit df.iat[0, 0]

13.7 µs ± 835 ns per loop (mean ± std. dev. of 7 runs, 100000 loops each)